Repository: yamarten/atproto-website
Catalog: translation/omegat/project_save.tmx
Source language: en_us
Languages: ja

source: The end result is that products built on these p2p protocols often feel spotty - posts and interactions are missing, global algorithms are impossible to create, and running these applications takes a noticeable hit on the battery life and resource usage of the devices they run on. In short, it doesn't seem tractable to replicate the seamless dynamic feel of the massive platforms of the modern web.
ja: 結果として、これらのP2Pプロトコル上に構築された製品はしばしば不安定に感じられます。投稿や反応が欠け、グローバルなアルゴリズムを作れず、アプリの実行はバッテリー寿命やデバイス資源に目に見える負荷を与えます。要するに、現代ウェブの巨大プラットフォームが持つシームレスで動的な感覚を再現するのは現実的ではありません。

source: The ergonomics of OAuth scopes in AT Protocol are still evolving. This minimal set is designed to provide a known-good starting point for app developers that does not grant unnecessary permissions. While we finalize granular permission scopes, we are also supporting a set of temporary coarse-grained scopes called the "transition scopes". There are currently no plans to deprecate either the transition scopes or the use of App Passwords. For an overview of these transition scopes, and more in-depth information on OAuth, see [Authorization Scopes](/specs/oauth#authorization-scopes). For the granular permission scopes, see [Permissions](/specs/permission).
ja: ATプロトコルにおけるOAuthスコープの使い心地はまだ発展途上です。この最小セットは、不要な権限を与えずにアプリ開発者が使える出発点を提供するよう設計されています。詳細な権限スコープを最終決定するまで、暫定的な粗い粒度のスコープ（「移行スコープ」）もサポートしています。現時点では、移行スコープまたはアプリパスワードの使用を廃止する計画はありません。これら移行スコープの概要やOAuthの詳細については[認可スコープ](/specs/oauth#authorization-scopes)を、細かな権限スコープについては[権限](/specs/permission)を参照してください。

source: The ergonomics of OAuth scopes in Atproto are still evolving. This minimal set is designed to provide a known-good starting point for app developers that does not grant unnecessary permissions. While we finalize granular permission scopes, we are also supporting a set of temporary coarse-grained scopes called the "transition scopes". There are currently no plans to deprecate either the transition scopes or the use of App Passwords. For an overview of these transition scopes, and more in-depth information on OAuth, see [Authorization Scopes](/specs/oauth#authorization-scopes). For the granular permission scopes, see [Permissions](/specs/permission).
ja: atprotoにおけるOAuthスコープの使い心地はまだ発展途上です。この最小セットは、不要な権限を与えずにアプリ開発者が使える出発点を提供するよう設計されています。詳細な権限スコープを最終決定するまで、暫定的な粗い粒度のスコープ（「移行スコープ」）もサポートしています。現時点では、移行スコープまたはアプリパスワードの使用を廃止する計画はありません。これら移行スコープの概要やOAuthの詳細については[認可スコープ](/specs/oauth#authorization-scopes)を、細かな権限スコープについては[権限](/specs/permission)を参照してください。

source: The evolution of the document-based web into the modern web should not be seen as a failure of the web. Rather, it's a testament to its success. The idea, ethos, and primitives that the web was built on were powerful and flexible enough to facilitate the creation of essentially a second layer to the web. However, in this evolution, we also lost something.
ja: 文書ベースのウェブが現代のウェブへ進化したことは、ウェブの失敗と見るべきではありません。むしろ、その成功の証です。ウェブを支える理念、思想、プリミティブは十分に強力で柔軟だったため、実質的にウェブの上に2つ目の層の創出を可能にしました。しかしこの進化の中で、私たちは何かを失ってもいます。

source: The experience is better in the app. Download Bluesky now and we'll pick back up where you left off.
ja: アプリのほうがより良い体験をすることができます。今すぐBlueskyをダウンロードして、中断したところから再開しましょう。

source: The feed has been replaced with Discover.
ja: フィードはDiscoverと置き換えられました。

source: The first and most obvious influence on atproto is the web itself.
ja: atprotoへの最初で最も明白な影響は、ウェブそのものです。

source: The first is because only label values which are defined globally can be used as self-labels (ie set by a user who is not a Labeler). The porn, sexual, gore, nudity, and !no-unauthenticated labels are global for this reason.
ja: 1番目の理由は、グローバルに定義されているラベル値のみがセルフラベルとして使用できる（つまり、ラベラーではないユーザーによって設定される）からです。porn、sexual、gore、nudity、および!no-unauthenticatedラベルはこの理由でグローバルになっています。

source: The first step when working with AT data is authenticating. You can authenticate using any [OAuth](/guides/auth) provider, or with `AtpAgent()` from our SDK if you are using password auth.
ja: ATデータを扱う最初のステップは認証です。任意の[OAuth](/guides/auth)プロバイダを使用して認証することもできますし、パスワードを使用している場合はSDKの`AtpAgent()`を使用して認証することもできます。

source: The following are all valid user identifiers:
ja: 以下はすべて有効なユーザー識別子です。

source: The following are informal guidelines, mostly to communicate order-of-magnitude expectations, and are likely to evolve over time. They are not part of the atproto specification, but if you are pushing the limits here, you may encounter interoperability issues now or in the future.
ja: 以下は非公式なガイドラインであり、主に大まかな期待を伝えるためのものであり、時間の経過とともに進化する可能性があります。これらはatproto仕様の一部ではありませんが、この制限を超えている場合、現在または将来の相互運用性の問題に遭遇する可能性があります。

source: The following labels were applied to your account.
ja: 以下のラベルがあなたのアカウントに適用されました。

source: The following labels were applied to your content.
ja: 以下のラベルがあなたのコンテンツに適用されました。

source: The following settings will be used as your defaults when creating new posts. You can edit these for a specific post from the composer.
ja: 新しい投稿を作成する場合、以下の設定がデフォルトとして使用されます。個々の投稿に対する設定は編集画面から変更できます。

source: The general flow of providing a custom algorithm to a user is as follows:
ja: ユーザーにカスタムアルゴリズムを提供する一般的なフローは以下の通りです。

source: The generated code will live in `src/lexicons`.
ja: 生成されたコードは`src/lexicons`に配置されます。

source: The generated code will live in `src/lexicons`. Now you can create your bot script.
ja: 生成されたコードは`src/lexicons`に配置されます。これでボットスクリプトを作成できます。

source: The goal of AT Protocol is to interconnect applications so that their backends share state, including user accounts and content.
ja: ATプロトコルの目標は、アプリケーションを相互接続して、バックエンド間でユーザーアカウントやコンテンツなどの状態を共有することです。

source: The good news is that this architecture scales pretty well. We've given up strong consistency and sometimes our read queries lag behind the most up to date version of the data, but the service doesn't drop writes or enter an incorrect state.
ja: 良いニュースは、このアーキテクチャの拡張性が非常に高いことです。強い一貫性はあきらめ、読み取りクエリがデータの最新バージョンより遅れることもありますが、サービスが書き込みをドロップしたり、誤った状態になったりすることはありません。

source: The in-memory approach used so far works for local development, but for production you'll want a proper database. Let's add SQLite and some other dependencies to manage this:
ja: ここまで使ってきたインメモリ方式はローカル開発には十分ですが、本番では適切なデータベースが必要です。SQLiteとその依存関係を追加しましょう。

source: The introduction of distributed systems also introduces distributed problems. Decomposed micro-services give up on the idea of maintaining a strongly consistent view of all the data on the platform. In some cases this means the use of eventually consistent databases tailored to high throughput, such as Scylla (which we use at Bluesky). Databases like Scylla give up the ACID guarantees and support for rich dynamic queries that more traditional SQL databases offer. Rather they require the indices and access patterns of the data to be known ahead of time.
ja: 分散システムの導入は、分散による問題も導入します。分解されたマイクロサービスは、プラットフォーム上のすべてのデータについて強い一貫性を保つという考えを放棄します。場合によっては、Blueskyが使っているScyllaのような、高スループット向けの結果整合性を備えたデータベースを使うことを意味します。Scyllaのようなデータベースは、従来のSQLデータベースが提供するACID特性やリッチな動的クエリのサポートを手放します。代わりに、データのインデックスとアクセスパターンを事前に把握しておかなければいけません。

source: The introduction of new database technologies and the general trend of micro-services brought even more problems. Micro-services often need access to the same data. If a micro-service goes down for a period of time, it needs a mechanism to catch up with everything that happened. And applications need a way to create new indices even over past data. An approach of stream processing helped to answer many of these issues. In a stream processing architecture - most prominently exemplified by Kafka - you maintain an event log of all events that flow through a system. Many consumers tap into this event log. If a consumer goes offline, when it comes back it can pick back up where it left off. And if a new index needs to be created, the entire event log can simply be replayed. These stream processing tools serve as a “backbone” of canonical data that enable the platform to coalesce around a single source of truth.
ja: 新しいデータベース技術の導入やマイクロサービス化の流れは、さらに多くの問題をもたらしました。マイクロサービスはしばしば同じデータへアクセスする必要があります。マイクロサービスがしばらく停止した場合、その間に起きたすべてに追いつく仕組みが必要です。さらに、過去のデータを含めて新しいインデックスを作る手段も必要になります。ストリーム処理のアプローチは、こうした問題の多くに答えを与えました。Kafkaに代表されるストリーム処理アーキテクチャでは、システムを流れるすべてのイベントのログを保持します。多くのコンシューマーがこのイベントログに接続します。コンシューマーがオフラインになっても、復帰時に中断点から再開できます。新しいインデックスが必要になれば、イベントログ全体をリプレイすればよいのです。これらのストリーム処理ツールは、プラットフォームが信頼できる唯一の情報源に収束するための背骨として機能します。

source: The laws in your location require you to verify you're an adult to access certain features. Tap to learn more.
ja: あなたの地域の法律では、特定の機能にアクセスするにはあなたが成人であることを確認する必要があります。詳細はタップしてください。

source: The lower-level primitives that can get stacked together differently are the repositories, lexicons, and DIDs. We published an overview of our technical decisions around federation architecture [on our blog](https://bsky.social/about/blog/5-5-2023-federation-architecture).
ja: さまざまな方法でスタックできる下位レベルのプリミティブは、リポジトリ、レキシコン、およびDIDです。フェデレーションアーキテクチャに関する技術的な決定の概要を[ブログ](https://bsky.social/about/blog/5-5-2023-federation-architecture)で公開しました。

source: The minimal set of OAuth permissions that a third-party AT application should request to sign in with Bluesky are: - `atproto`
ja: BlueskyでサインインするためにサードパーティのATアプリが要求すべき最小限のOAuth権限は次のとおりです。 - `atproto`

source: The modern web mostly takes place on a few large platforms like Facebook or Youtube where users have accounts and post content or view and interact with content from other accounts. These interactions and content often don't look like “documents” in the traditional sense. The content is all still deeply interconnected, but those connections are generally restricted to the boundaries of the platform that they are created through.
ja: 現代のウェブは主にFacebookやYouTubeのような少数の巨大プラットフォーム上で展開され、ユーザーはそこにアカウントを持ってコンテンツを投稿し、他のアカウントのコンテンツを閲覧・交流します。これらのやり取りやコンテンツは、伝統的な意味での「文書」に見えないことが多いです。コンテンツ同士は依然として深く相互接続されていますが、その接続は一般に作成されたプラットフォームの境界内に制限されます。

source: The name is also a play on the "@" symbol, aka the "at" symbol, since atproto is designed for social systems.
ja: この名前は、atprotoがソーシャルシステム向けに設計されているため、「@」記号、別名「at」記号をもじったものです。

source: The new account will be in a `deactivated` state. It should be possible to directly login and authenticate, but not to participate in the network. From the perspective of other services in the network, the old PDS account is still current, and the new PDS account is not yet active or valid. Functionality like OAuth or proxied requests using service auth will not yet work with the new PDS.
ja: 新しいアカウントは`deactivated`状態になります。直接ログインや認証は可能なはずですが、ネットワークに参加することはできません。ネットワーク内の他のサービスから見ると旧PDSのアカウントが依然として現役であり、新PDSのアカウントはまだ有効でも正当でもありません。OAuthやサービス認証を用いたプロキシなどの機能は新PDSではまだ動作しません。

source: The other major issue with these systems is that the rich social media sites that users had become accustomed to in the modern web rely on large compute and storage intensive indices. Getting servers out of the mix meant that all of that resource usage moved onto users' devices. Timeline generation, thread construction, aggregating interaction counts, social graph queries, and more all had to be done on relatively underpowered end user devices.
ja: もう一つの大きな問題は、現代のウェブでユーザーが慣れ親しんだリッチなソーシャルメディアが、大規模な計算・ストレージ集約型のインデックスに依存していることです。サーバーを排除することは、そのリソース消費がすべてユーザーのデバイスに移ることを意味します。タイムライン生成、スレッド構築、インタラクション数の集計、ソーシャルグラフのクエリなどを、相対的に非力なエンドユーザーデバイスで行わなければなりません。

source: The other side of moving application-specific details out of the PDS is that it also gives applications the liberty to experiment and rapidly iterate on application semantics. Product development can occur in a centralized way. This centralization is critical to the ability to build new products in the network. We took a mentality of “no steps backwards” when it came to product development. Projects should be able to use modern tooling and product/application development patterns. Products benefit from the ability to rapidly iterate which requires clear ownership of application domains.
ja: PDSからアプリケーション固有の詳細を切り離すことのもう一つの側面は、アプリケーションに実験と迅速な反復の自由を与えることです。プロダクト開発は集権的に行えます。この集権性は、ネットワーク上で新しいプロダクトの構築し易さのために重要です。私たちはプロダクト開発において「後退なし」という考え方を採用しました。プロジェクトは現代的なツールやプロダクト/アプリ開発パターンを使えるべきです。プロダクトは迅速な反復の恩恵を受けるため、そのためにはアプリケーション領域の明確な所有が必要です。

source: The peer-to-peer (p2p) movement was in many ways a reaction to the emergence of the massive platforms that came to dominate the modern web. Idealistic and radical (sometimes to a fault), the p2p movement asked if we could remove backend applications from the mix entirely.
ja: ピアツーピア（P2P）ムーブメントは、色々な意味で現代のウェブを支配する巨大プラットフォームの出現への反動でした。理想主義的で急進的（時に行き過ぎるほど）なこのムーブメントは、バックエンドアプリケーションを完全に排除できないかと問いかけました。

source: The permissionlessness of the web requires distributed authority of content. That is, there isn't a central authority that decides what is included in the web or if some content is “legitimate” or not. Rather, each computer that publishes and hosts a document is the authority for that document. This authority is **location-based**, meaning you can find out what the document hosted at a given site is by talking to that site and receiving the document. This sounds a little obvious when spelled out, but it's actually a radical idea. There's no need for distributors, document certifiers or central registries of documents.
ja: ウェブの許可不要性には、コンテンツの権限が分散していることが必要です。つまり、ウェブに何を含めるか、あるコンテンツが「正当」かどうかを決める権威は存在しません。代わりに、文書を公開・ホストする各コンピューターが、その文書の権威となります。この権威は**場所に基づく**もので、あるサイトにホストされた文書が何かは、そのサイトと通信して文書を受け取ることで分かります。言葉にすると当たり前に聞こえますが、実はこれはラディカルな発想です。配布業者や文書の認証者、文書の中央レジストリは必要ありません。

source: The phrase “atproto ethos” often comes up during our protocol design discussions. It's a fuzzy term, but we use it to refer to the philosophical and aesthetic principles that underlie the design of the network. {{className: 'lead'}}
ja: 「atproto ethos」という言葉は、私たちのプロトコル設計の議論の中でよく登場します。曖昧な用語ではありますが、ネットワーク設計の根底にある哲学的・美学的な原則を指すために使っています。 {{className: 'lead'}}

source: The post you're replying to was marked as being written in {suggestedLanguageName} by its author. Would you like to reply in <0>{suggestedLanguageName}</0>?
ja: 返信先の投稿は{suggestedLanguageName}で書かれていると投稿者に設定されています。<0>{suggestedLanguageName}</0>で返信しますか？

source: The relationship between them can be visualized as:
ja: これらの関係は次のように視覚化できます。

source: The relevant events and behaviors when migrating an account to a new PDS:
ja: 新しいPDSへのアカウント移行に関連するイベントと挙動は以下の通りです。

source: The same blob can be referenced by multiple records in the same repository. Re-uploading a blob which has already been stored and referenced results in no change to the existing blobs or records.
ja: blobは同じリポジトリ内の複数のレコードから参照できます。既に参照されている保存済みのblobを再度アップロードしても、既存のblobやレコードに変更は生じません。

source: The schema types, definition language, and validation constraints are described in the [Lexicon specification](/specs/lexicon), and representations in JSON and CBOR are described in the [Data Model specification](/specs/data-model).
ja: スキーマの種類、定義言語、および制約検証は[Lexicon仕様](/specs/lexicon)で説明されており、JSONおよびCBORでの表現は[データモデル仕様](/specs/data-model)で説明されています。

source: The schemas are identified using [NSIDs](/specs/nsid), a reverse-DNS format. Here are some example API endpoints:
ja: スキーマは[NSID](/specs/nsid)を使用して識別されます。これは逆ドメイン名形式です。以下にAPIエンドポイントの例を示します。

source: The schemas establish valid query parameters, request bodies, and response bodies.
ja: スキーマは有効なクエリパラメータ、リクエストボディ、およびレスポンスボディを規定します。

source: The second is because some special behaviors, like "non-configurable" and "applies only to logged out users," cannot be applied to custom labels. The !hide, !warn, and !no-unauthenticated labels are global for this reason.
ja: 2番目の理由は、「設定不可能」や「非ログインユーザーにのみ適用」などの特別な動作をカスタムラベルには規定できないからです。!hide、!warn、および!no-unauthenticatedラベルはこの理由でグローバルになっています。

source: The secret sauce here is [Litestream](https://fly.io/blog/litestream-v050-is-here/), which does exactly that — [Backups and Recovery for SQLite](https://github.com/benbjohnson/litestream). To get a recoverable, scalable PDS SQLite deployment with Litestream, we recommend:
ja: 秘訣は[Litestream](https://fly.io/blog/litestream-v050-is-here/)です。これはまさしく[SQLiteのバックアップと復旧](https://github.com/benbjohnson/litestream)を行います。Litestreamで復旧可能でスケーラブルなPDS SQLiteデプロイメントを取得するには、以下をお勧めします。

source: The selected video is larger than 100 MB. Please try again with a smaller file.
ja: 選択したビデオが100MBより大きいです。小さいファイルでもう一度お試しください。

source: The server appears to be experiencing issues. Please try again in a few moments.
ja: サーバーで問題が発生しているようです。少し間をおいて再度試してください。

source: The service auth token is provided along with the existing DID when creating the account with `com.atproto.server.createAccount` (or an equivalent interface/API) on the new PDS.
ja: サービス認証トークンは、新しいPDS上で`com.atproto.server.createAccount`（または同等のAPI）を使ってアカウントを作成する際に、既存のDIDとともに提供します。

source: The sidecar records can be updated (mutated) without breaking strong references to the original record.
ja: サイドカーレコードは、元のレコードへの強い参照を壊さずに更新（変更）できます。

source: The signing key is entrusted to the PDS so that it can manage the user's data, but rotation keys can be controlled by the user, e.g. as a paper key. This makes it possible for the user to update their account to a new PDS without the original host's help.
ja: 署名鍵はPDSに委託され、ユーザーのデータを管理できるようにしますが、ローテーション鍵はユーザーが保存することもできます（紙に印刷するなど）。これにより、ユーザーは元のホストの助けを借りずにアカウントを新しいPDSに更新できます。

source: The starter pack that you are trying to view is invalid. You may delete this starter pack instead.
ja: 見ようとしたスターターパックが無効です。代わりにスターターパックを削除してください。

source: The string and bytes record data types are intended for constrained data size use-cases. For text or binary data of larger size, blob references should be used. This can include longer-form text and structured data.
ja: レコードにおける文字列型とバイト型は、データサイズ制約が強い用途向けです。より大きなサイズのテキストまたはバイナリデータの場合、blob参照を使用してください。これには、長文テキストや構造化データも含まれます。

source: The subject of the context menu
ja: コンテキストメニューの件名

source: The support form has been moved. If you need help, please <0/> or visit {HELP_DESK_URL} to get in touch with us.
ja: サポートフォームは移動しました。サポートが必要な場合は、<0/>または{HELP_DESK_URL}にアクセスしてご連絡ください。

source: The three core services in our network are Personal Data Servers (PDS), Relays, and App Views. There are also supporting services such as feed generators and labelers.
ja: ネットワークの3つのコアサービスは、パーソナルデータサーバー（PDS）、リレー、およびAppViewです。フィード ジェネレーターとラベラーにも取り組んでいます。

source: The upload blob can now be referenced from records by including the returned blob metadata in a record. When processing record creation, the server extracts the set of all referenced blobs, and checks that they are either already referenced, or are in temporary storage. Once the record creation succeeds, the server makes the blob publicly accessible.
ja: アップロードされたblobは、返されたblobメタデータをレコードに含めることで、レコードから参照できます。レコード作成時に、サーバーは参照されているすべてのblobを抽出し、それらが既に参照されているか、一時ストレージにあるかを確認します。レコード作成に成功すると、サーバーはblobを公開アクセス可能にします。

source: The use of `inheritAud` in the `rpc` permission allows you to [control inheritance behavior](/specs/permission#rpc).
ja: `rpc`権限における`inheritAud`の使用により、[継承の挙動](/specs/permission#rpc)を制御できます。

source: The user can activate their account on the new PDS with a call to `com.atproto.server.activateAccount`, and deactivate their account on the old PDS with `com.atproto.server.deactivateAccount`.
ja: ユーザーは`com.atproto.server.activateAccount`を呼び出すことで新PDS上でアカウントを有効化でき、旧PDS上では`com.atproto.server.deactivateAccount`を使ってアカウントを無効化できます。

source: The user is then recommended to submit the operation to the new PDS (using the `com.atproto.identity.submitPlcOperation` endpoint), which will validate that the changes are "safe" (aka, that they enable the the PDS to help manage the identity and atproto account), and then submit it to the PLC directory.
ja: その後、ユーザーはそのオペレーションを新PDS（`com.atproto.identity.submitPlcOperation`エンドポイント）に提出することが推奨されます。新PDSは変更が安全であること（すなわちPDSがIDとatprotoアカウントの管理を支援できること）を検証した後、PLCディレクトリへ提出します。

source: The verification code you have provided is invalid. Please make sure that you have used the correct verification link or request a new one.
ja: 入力された確認コードが正しくありません。正しいリンクを使用したかを確認するか、新しい確認コードを要求してください。

source: The verification provider was unable to send a code to your phone number. Please check your phone number and try again.
ja: 認証プロバイダがあなたの電話番号にコードを送信できませんでした。電話番号を確認して、もう一度お試しください。

source: The way custom feeds work is straightforward: the server receives a request from a user's server and returns a list of post URIs with some optional metadata attached. Those posts are then hydrated into full views by the requesting server and sent back to the client.
ja: カスタムフィードの仕組みは単純です。サーバーはユーザーのサーバーからリクエストを受け取り、オプションのメタデータが付加された投稿URIのリストを返します。これらの投稿はリクエスト元のサーバーによって完全なビューに変換され、クライアントに送り返されます。

source: The web described here, the document-based web, is commonly referred to as Web 1.0. But Web 2.0, the web that we've been living with for the last 20 years, is quite different in its shape and function.
ja: ここで述べた文書ベースのウェブは、一般にWeb 1.0と呼ばれます。しかし、ここ20年私たちが暮らしてきたWeb 2.0は、形と機能が大きく異なります。

source: The web is an information system for publishing and accessing documents over the internet. It's permissionless to join and interact with. This guarantee is predicated on similar guarantees in the underlying internet. However, if the internet is functioning properly and you have a computer, an internet connection, and an IP address you can host a document on the web.
ja: ウェブは、インターネット上で文書を公開しアクセスするための情報システムです。参加や相互作用に許可は不要です。この保証は、下層のインターネットにおける同様の保証を前提としています。インターネットが正しく機能していて、コンピューター、インターネット接続、そしてIPアドレスがあれば、誰でもウェブ上で文書をホストできます。

source: The web requires a fair bit of trust with the services you interact with. While the transport layer is secured, the data that you receive from a given server is attested to solely by the fact that you received it from that server. If you load a post from a friend on Facebook for instance, you have to trust Facebook that they're serving you the correct post text. Similarly you have to trust Facebook to be a good custodian of your account and your data.
ja: ウェブでは、やり取りするサービスに対する相当の信頼が必要です。トランスポート層が保護されていても、特定のサーバーから受け取るデータの正しさは、そのサーバーから受け取ったという事実だけで証明されます。例えばFacebookで友人の投稿を読み込む場合、Facebookが正しい投稿本文を提供していると信頼しなければなりません。同様に、アカウントとデータの良き管理者であることもFacebookに信頼を置く必要があります。

source: Theme
ja: テーマ

source: Then let's say we scale our database horizontally through sharding and replicas.
ja: 次に、シャーディングとレプリカを使用してデータベースを水平方向にスケーリングするとします。

source: Then, add additional functions to fetch account handles and statuses:
ja: 続いて、アカウントハンドルとステータスを取得する関数を追加します。

source: Then, add another environment variable to your `.env` file:
ja: 次に、`.env`ファイルへ環境変数を1つ追加します。

source: Then, add the actual database connection in `lib/db/index.ts`:
ja: 続いて、実際のデータベース接続を`lib/db/index.ts`に追加します。

source: Then, create `app/oauth/login/route.ts`. This route initiates the login flow. You only need the user's handle — with it, you can resolve the user's Authorization Server (their PDS) and redirect them there:
ja: 続いて`app/oauth/login/route.ts`を作成します。このルートはログインフローを開始します。必要なのはユーザーのハンドルだけで、そこからユーザーの認可サーバー（PDS）へ解決してリダイレクトできます。

source: Then: 1. Navigate to your app in a browser at [http://127.0.0.1:3000]([http://127.0.0.1:3000]). 2. Enter your handle 3. Authorize the app 4. You should see "Authentication working!" with your DID:
ja: 1. ブラウザで[http://127.0.0.1:3000]([http://127.0.0.1:3000])にアクセスする 2. ハンドルを入力する 3. アプリを認可する 4. DIDとともに"Authentication working!"と表示される

source: There are a couple of details that might catch you off guard if you're used to using other OAuth systems.
ja: 他のOAuthシステムを使っている場合は細かい部分で意外に感じるかもしれません。

source: There are a few details that might catch you off guard if you're used to using other OAuth systems.
ja: 他のOAuthシステムを使っている場合は細かい部分で意外に感じるかもしれません。

source: There are a few label values which are defined by the protocol. They are:
ja: プロトコルで定義されているいくつかのラベル値があります。
